models/autoports/qwen_qwen3_4b/readiness_vllm/vllm_benchmark.log
INFO 07-03 06:53:31 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 07-03 06:53:31 [__init__.py:46] - tt -> vllm_tt_plugin.entrypoints:platform_plugin
INFO 07-03 06:53:31 [__init__.py:58] Loading plugin tt
2026-07-03 06:53:33.490 | DEBUG    | ttnn:<module>:79 - Initial ttnn.CONFIG:
Config{cache_path=/home/ubuntu/.cache/ttnn,model_cache_path=/home/ubuntu/.cache/ttnn/models,tmp_dir=/tmp/ttnn,enable_model_cache=false,enable_fast_runtime_mode=true,throw_exception_on_fallback=false,enable_logging=false,enable_graph_report=false,enable_graph_python_stack_traces=false,enable_detailed_buffer_report=false,enable_detailed_tensor_report=false,enable_comparison_mode=false,comparison_mode_should_raise_exception=false,comparison_mode_pcc=0.9999,root_report_path=generated/ttnn/reports,report_name=std::nullopt,std::nullopt}
INFO 07-03 06:53:33 [__init__.py:212] Platform plugin tt is activated
INFO 07-03 06:53:40 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 07-03 06:53:40 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f874fadcb80>, trust_remote_code=False, seed=0, num_prompts=1, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='Qwen/Qwen3-4B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/home/ubuntu/tt-metal/models/autoports/qwen_qwen3_4b/readiness_vllm/vllm_result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-7ad64090-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 07-03 06:53:48 [datasets.py:607] Sampling input_len from [128, 128] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 1/1 [00:01<00:00,  1.90s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1
Failed requests:                         0
Maximum request concurrency:             1
Benchmark duration (s):                  1.90
Total input tokens:                      128
Total generated tokens:                  128
Request throughput (req/s):              0.53
Output token throughput (tok/s):         67.30
Peak output token throughput (tok/s):    88.00
Peak concurrent requests:                1.00
Total token throughput (tok/s):          134.60
---------------Time to First Token----------------
Mean TTFT (ms):                          218.95
Median TTFT (ms):                        218.95
P99 TTFT (ms):                           218.95
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.25
Median TPOT (ms):                        13.25
P99 TPOT (ms):                           13.25
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.25
Median ITL (ms):                         10.33
P99 ITL (ms):                            10.62
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1901.56
Median E2EL (ms):                        1901.56
P99 E2EL (ms):                           1901.56
==================================================
nanobind: leaked 92 instances!
 - leaked instance 0x269bcb50 of type "ttnn._ttnn.operations.unary.isnan_t"
 - leaked instance 0x269b66d0 of type "ttnn._ttnn.operations.unary.eqz_t"
 - leaked instance 0x28f0d9c0 of type "ttnn._ttnn.operations.unary.relu6_t"
 - leaked instance 0x7f8760888608 of type "ttnn._ttnn.operations.sliding_window.Op2DSliceConfig"
 - leaked instance 0x269bc220 of type "ttnn._ttnn.operations.unary.isinf_t"
 - leaked instance 0x294069a0 of type "ttnn._ttnn.operations.unary.log1p_t"
 - leaked instance 0x7f8760888128 of type "ttnn._ttnn.operations.sliding_window.Op2DSliceConfig"
 - leaked instance 0x269b9a30 of type "ttnn._ttnn.operations.unary.i0_t"
 - leaked instance 0x28e53820 of type "ttnn._ttnn.operations.unary.erfc_t"
 - leaked instance 0x291edfc0 of type "ttnn._ttnn.operations.unary.softplus_t"
 - leaked instance 0x28ab1aa0 of type "ttnn._ttnn.operations.unary.lgamma_t"
 - leaked instance 0x27dc1ae0 of type "ttnn._ttnn.operations.unary.floor_t"
 - leaked instance 0x293f95b0 of type "ttnn._ttnn.operations.unary.log2_t"
 - leaked instance 0x7f8761106148 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x28ebc390 of type "ttnn._ttnn.operations.unary.gelu_t"
 - leaked instance 0x28fb0c40 of type "ttnn._ttnn.operations.unary.isneginf_t"
 - leaked instance 0x269b8800 of type "ttnn._ttnn.operations.unary.gez_t"
 - leaked instance 0x28b1bb80 of type "ttnn._ttnn.operations.unary.digamma_t"
 - leaked instance 0x2944da30 of type "ttnn._ttnn.operations.unary.swish_t"
 - leaked instance 0x28724dc0 of type "ttnn._ttnn.operations.unary.rsqrt_t"
 - ... skipped remainder
nanobind: leaked 909 types!
 - leaked type "SocketEndpoint"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.gt__t"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.SliceDeviceOperation"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.MatmulMultiCoreReuseMultiCastBatchedDRAMShardedProgramConfig"
 - leaked type "ttnn._ttnn.operations.binary.lt__t"
 - leaked type "ttnn._ttnn.operations.binary_backward.xlogy_bw_t"
 - leaked type "ttnn._ttnn.operations.experimental.insert_t"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.isclose_t"
 - leaked type "ttnn._ttnn.operations.reduction.var_t"
 - leaked type "DispatchCoreAxis"
 - ... skipped remainder
nanobind: leaked 4183 functions!
 - leaked function ""
 - leaked function ""
 - leaked function "get_metadata_input_addr"
 - leaked function "clear_runtime_args"
 - leaked function "__call__"
 - leaked function ""
 - leaked function ""
 - leaked function ""
[...]
 - ... skipped remainder
nanobind: this is likely caused by a reference counting issue in the binding code.
See https://nanobind.readthedocs.io/en/latest/refleaks.html